/* SPDX-License-Identifier: AGPL-3.0-only */
/* SPDX-FileCopyrightText: 2025-2026 Yurii Arkhanhelskyi */
/* Описания доступа, которые ПОКАЗЫВАЕТ СИСТЕМА.
   Не переводы интерфейса: эти строки читает macOS в своём окне запроса,
   и язык там — системный, а не выбранный в настройках приложения.
   Правится вместе с macos/Runner/Info.plist: ключ, которого нет здесь,
   система покажет на языке разработки. */

"NSMicrophoneUsageDescription" = "Secretly verwendet das Mikrofon für Sprach- und Videoanrufe sowie zum Aufnehmen von Sprachnachrichten.";
"NSCameraUsageDescription" = "Secretly verwendet die Kamera für Videoanrufe und zum Scannen von QR-Codes zur Geräteverknüpfung.";
"NSPhotoLibraryUsageDescription" = "Secretly verwendet deine Fotos, um Bilder in Chats zu senden.";
"NSDocumentsFolderUsageDescription" = "Secretly verwendet deinen Ordner „Dokumente“, um Dateien in Chats zu senden.";
"NSDownloadsFolderUsageDescription" = "Secretly verwendet deinen Ordner „Downloads“, um Dateien aus Chats zu sichern.";
"NSDesktopFolderUsageDescription" = "Secretly verwendet deinen Schreibtisch, um Dateien und Bildschirmfotos zu senden.";
"NSAppleEventsUsageDescription" = "Secretly verwendet Apple Events für die Anbindung an die Systemmitteilungen.";
